{
  "version": "v1.0.0",
  "entity": {
    "type": "individual",
    "role": "owner",
    "name": "Emma Irwin",
    "email": "info@oss-wishlist.com",
    "description": "Building community infrastructure for open source sustainability. Focused on creating standardized ways for maintainers to express needs, paying skilled practitioners to solve sustainability problems, and making that impact systematically visible to funders through shared standards. Delivering end-to-end ecosystem impact where people are paid, sustainability problems are solved, and outcomes become discoverable signals that drive further investment.",
    "webpageUrl": {
      "url": "https://oss-wishlist.org"
    }
  },
  "projects": [
    {
      "guid": "open-source-wishlist",
      "name": "Open Source Wishlist",
      "description": "Open Source Wishlist is community-driven infrastructure that standardizes how open source maintainers express sustainability needs and how paid practitioners solve those problems with systematically visible outcomes. Maintainers create validated wishlists from standardized categories—funding strategy, governance, leadership continuity, security, documentation, and more. Skilled practitioners are compensated to fulfill wishes, with outcomes documented as ground-truth data for AI benchmarks and OER playbooks. This creates end-to-end ecosystem impact: maintainers receive help, practitioners are paid for their expertise, sustainability problems are solved, and funders gain systematic visibility into impact through standardized signals. Wishlist data integrates into ecosyste.ms, making sustainability needs and outcomes discoverable across millions of open source projects. We provide the connective infrastructure that allows existing funding tools to interoperate through shared standards while building the data foundations for AI-assisted sustainability work.",
      "webpageUrl": {
        "url": "https://oss-wishlist.org"
      },
      "repositoryUrl": {
        "url": "https://github.com/oss-wish-list/oss-wishlist-website"
      },
      "licenses": ["spdx:MIT"],
      "tags": [
        "open-source",
        "sustainability",
        "community",
        "infrastructure",
        "developer-tools",
        "funding",
        "maintainers",
        "security",
        "leadership-continuity",
        "oer"
      ]
    }
  ],
  "funding": {
    "channels": [
      {
        "guid": "github-sponsors",
        "type": "payment-provider",
        "address": "https://github.com/sponsors/emmairwin",
        "description": "Support via GitHub Sponsors"
      },
      {
        "guid": "open-collective",
        "type": "payment-provider",
        "address": "https://opencollective.com/oss-wishlist",
        "description": "Support via Open Collective with transparent budget tracking"
      }
    ],
    "plans": [
      {
        "guid": "ecosystem-coverage",
        "status": "active",
        "name": "Critical Infrastructure Coverage",
        "description": "Scale validated wishlists to 200 critical open source projects across multiple ecosystems and technologies. Reduces ecosystem-wide risk by creating visibility into sustainability gaps across foundational dependencies.",
        "amount": 25000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": ["github-sponsors", "open-collective"]
      },
      {
        "guid": "practitioner-network",
        "status": "active",
        "name": "Practitioner Capacity Building",
        "description": "Onboard 10 skilled practitioners with coverage across all sustainability categories (security, governance, documentation, leadership continuity). Unlocks latent capacity in the ecosystem by creating structured pathways for meaningful contribution beyond code.",
        "amount": 15000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": ["github-sponsors", "open-collective"]
      },
      {
        "guid": "proof-of-model",
        "status": "active",
        "name": "End-to-End Model Validation",
        "description": "Complete 5 wishes across categories, documenting outcomes as proof that the model works. Generates ground-truth data for OER playbooks and AI benchmarks, demonstrating measurable impact from funder investment to resolved sustainability need.",
        "amount": 10000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": ["github-sponsors", "open-collective"]
      },
      {
        "guid": "ecosystem-integration",
        "status": "active",
        "name": "Supply Chain Visibility Integration",
        "description": "Integrate wishlist data into ecosyste.ms dataset and publish GitHub Action for dependency visibility. Makes sustainability signals discoverable where developers already work, enabling proactive risk identification across software supply chains.",
        "amount": 10000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": ["github-sponsors", "open-collective"]
      },
      {
        "guid": "sustainer",
        "status": "active",
        "name": "Sustainer",
        "description": "Ongoing support for open source sustainability infrastructure development.",
        "amount": 0,
        "currency": "USD",
        "frequency": "monthly",
        "channels": ["github-sponsors", "open-collective"]
      }
    ],
    "history": []
  }
}
