{
  "version": "v1.0.0",
  "entity": {
    "type": "individual",
    "role": "owner",
    "name": "Emma Irwin",
    "email": "info@oss-wishlist.com",
    "description": "Building community infrastructure for open source sustainability. Focused on creating standardized ways for maintainers to express needs, for funders to discover impact opportunities, and for practitioners to contribute meaningfully beyond code.",
    "webpageUrl": {
      "url": "https://oss-wishlist.org"
    }
  },
  "projects": [
    {
      "guid": "open-source-wishlist",
      "name": "Open Source Wishlist",
      "description": "Open Source Wishlist is community-driven infrastructure that standardizes how open source maintainers express sustainability needs and how those needs become discoverable across the ecosystem. Maintainers create validated wishlists from standardized categories known to impact sustainability—funding strategy, governance, leadership continuity, security, documentation, and more. These wishes become available via API and integrate into ecosyste.ms, the comprehensive open dataset covering millions of open source projects. The project addresses a structural gap: despite years of discussion about open source sustainability, no clear pathway exists for maintainers to express what they need and receive appropriate help. We provide the connective infrastructure that allows existing tools (Open Collective, GitHub Sponsors, Tidelift, etc.) to interoperate through shared standards.",
      "webpageUrl": {
        "url": "https://oss-wishlist.org"
      },
      "repositoryUrl": {
        "url": "https://github.com/oss-wish-list/oss-wishlist-website"
      },
      "licenses": ["spdx:MIT"],
      "tags": [
        "open-source",
        "sustainability",
        "community",
        "infrastructure",
        "developer-tools",
        "funding",
        "maintainers",
        "security",
        "leadership-continuity",
        "oer"
      ]
    }
  ],
  "funding": {
    "channels": [
      {
        "guid": "github-sponsors",
        "type": "payment-provider",
        "address": "https://github.com/sponsors/emmairwin",
        "description": "Support via GitHub Sponsors"
      },
      {
        "guid": "open-collective",
        "type": "payment-provider",
        "address": "https://opencollective.com/oss-wishlist",
        "description": "Support via Open Collective with transparent budget tracking"
      }
    ],
    "plans": [
      {
        "guid": "ecosystem-coverage",
        "status": "active",
        "name": "Critical Infrastructure Coverage",
        "description": "Scale validated wishlists to 200 critical open source projects across multiple ecosystems and technologies. Reduces ecosystem-wide risk by creating visibility into sustainability gaps across foundational dependencies.",
        "amount": 25000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": ["github-sponsors", "open-collective"]
      },
      {
        "guid": "practitioner-network",
        "status": "active",
        "name": "Practitioner Capacity Building",
        "description": "Onboard 10 skilled practitioners with coverage across all sustainability categories (security, governance, documentation, leadership continuity). Unlocks latent capacity in the ecosystem by creating structured pathways for meaningful contribution beyond code.",
        "amount": 15000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": ["github-sponsors", "open-collective"]
      },
      {
        "guid": "proof-of-model",
        "status": "active",
        "name": "End-to-End Model Validation",
        "description": "Complete 5 wishes across categories, documenting outcomes as proof that the model works. Generates ground-truth data for OER playbooks and AI benchmarks, demonstrating measurable impact from funder investment to resolved sustainability need.",
        "amount": 10000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": ["github-sponsors", "open-collective"]
      },
      {
        "guid": "ecosystem-integration",
        "status": "active",
        "name": "Supply Chain Visibility Integration",
        "description": "Integrate wishlist data into ecosyste.ms dataset and publish GitHub Action for dependency visibility. Makes sustainability signals discoverable where developers already work, enabling proactive risk identification across software supply chains.",
        "amount": 10000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": ["github-sponsors", "open-collective"]
      },
      {
        "guid": "sustainer",
        "status": "active",
        "name": "Sustainer",
        "description": "Ongoing support for open source sustainability infrastructure development.",
        "amount": 0,
        "currency": "USD",
        "frequency": "monthly",
        "channels": ["github-sponsors", "open-collective"]
      }
    ],
    "history": []
  }
}
